# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на
# круглой грядке, причём кусты высажены только по окружности. Таким образом, у 
# каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло 
# различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним. Напишите программу для 
# нахождения максимального числа ягод, которое может собрать за один заход 
# собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

numBush = int(input("Введите количество кустов: "))
# Bush = list (range(1, numBush+1))
# numBery = []
# for i in range(numBush):
#     Bery= [int(input("Введите ягод на кусте: "))]
#     numBery.append(Bery)
# numBery = list (numBery)
print(f"Количество кустов {numBush}")
# print(f"Список кустов {Bush}")
# print(f"Список ягод {numBery}")



#print(f"и множесва {mas2}")
#print(f" это {intersection}")

